NTLabRadio/SDRDemonstator9943/SDRDemon/Common/stm32f10x_sdr.c
/************************************************************************************************************
 *
 *  $Copyright © 2012-2014 CML Systems $
 *
 *  $Header: stm32f10x_sdr.c  Revision:1.15.1.3  02 July 2014 17:53:28  ilewis $
 *  $Label: ES994334 $
 *
 *  THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 *  WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 *  TIME. AS A RESULT, CML MICROSYSYEMS SHALL NOT BE HELD LIABLE FOR ANY
 *  DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 *  FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 *  CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 *************************************************************************************************************/

// Includes

#include "stm32f10x_sdr.h"
#include "stdlib.h"

#ifdef TARGET_DMR
 #ifdef DEBUG_CHANGE_INC_FROM_INITIAL_SDR_PROJECT
	#include "..\DMR\mainDMR.h"
 #else
  #include "mainDMR.h"
 #endif
extern DMR_TypeDef dmr;
#else 
 #ifdef TARGET_PMR
 #include "mainPMR.h" 
extern PMR_TypeDef pmr;
 #endif
#endif


// Local function prototypes.

void TIM2_Init (void);
void TIM3_Init (void);
// Timer for CMX7161 timeouts.
void TIM4_Init (void);
// Timer for CMX7262 timeouts.
void TIM5_Init(void);

void FT232_USART_Init (void);
uint32_t FT232_USART_TIMEOUT_UserCallback(void);

void CBUS_Init (void);
uint32_t CBUS_TIMEOUT_UserCallback(void);

void PortE_Init (void);
void SDR_Dummy_IRQ (void *pData);

void PendSV_Priority (uint8_t uPriority);
void SysTick_Priority (uint8_t uPriority);


// Table for CBUS interrupt handlers.
CBUS_IRQ_TypeDef CBUS_IRQTable[CBUS_NUMBER_OF_INTERFACES];

// Global within the scope of this file so that all the init routines can configure GPIO.
static GPIO_InitTypeDef  GPIO_InitStructure;

__IO uint32_t  FT232_USARTTimeout = FT232_USART_FLAG_TIMEOUT;
__IO uint32_t  CBUSTimeout = CBUS_TIME_OUT;

// Collects all the hardware initialisation for the SDR card, GPIO, Timers, USART, CBUS
// into one function call which can be made from either the script or standalone DMR
// application.

void SDR_Init( void )
{

  // Initialise to a dummy function to start with. This is a table of function pointers
  // which in our case point to the interrupt handlers.
  CBUS_IRQTable[CBUS_INTERFACE_1].pHandler = SDR_Dummy_IRQ;
  CBUS_IRQTable[CBUS_INTERFACE_2].pHandler = SDR_Dummy_IRQ;

   // Initialise 2 * 16 bit timers to replicate the 32 bit Hyperstone timer used for script delays.
  TIM2_Init();
  TIM3_Init();
  // Timers for Transcode and Modem Mode timeouts.
  TIM4_Init();
  TIM5_Init();

  // Initialise the CBUS interface.
  CBUS_Init();

  // Initialise the FTDI USART interface.
  FT232_USART_Init();

  // Enable Test port (GPIOE) for the LEDs and test loop connections.
  PortE_Init();
  GPIO_SetBits(GPIOE ,AUDIO_PA);

}

// Provides initialisation for the debug port, which has the two LEDs and five test loops
// and the audio PA attached.

void PortE_Init (void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  // Enable Test port (GPIOE) for the LEDs and test loop connections.
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE);
  GPIO_InitStructure.GPIO_Pin = TEST_RED_LED_D8 | TEST_GREEN_LED_D7 | TEST_TL1 | TEST_TL2 | TEST_TL3 | TEST_TL4 | TEST_TL5 | AUDIO_PA;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(TEST_PORT, &GPIO_InitStructure);
}

#define	LOAD_FI_END	0

// This function is designed to load an FI defined in a FI header file down the CBUS onto
// a PDSP6. The FI is split up into data blocks - each with a header. The parameter is
// a reference to the CBUS interface.

#ifdef TARGET_DMR	
//CMX7161 and CMX7262 use this style of bootloader
uint16_t SDR_Load_FI (cmxFI_TypeDef *pFI, uint8_t uInterface )
{
	uint16_t	*pData;
	uint16_t 	start_code;
	uint16_t 	length;
	uint16_t	data;
	uint16_t	state;

	uint16_t	uTxFIFOCount;
        
        char tempstr[5];        //used to comvers the version from hex to decimal

	uTxFIFOCount = 0;
	data = 0;
	state = 0;
	// Write a general reset to the pDSP6
	CBUS_Write8(1, (uint8_t *)&data, 0, uInterface);
	// Wait for a second.
	ClearCounter();
	while (ReadCounter() < 1000000);

	// Read the FIFO output level. It should be 3
	CBUS_Read8 (0x4F,(uint8_t*)&data,1,uInterface);

	// Read the 3 device check words.
	if (data == 3)
	{
		CBUS_Read16 (0x4D,&data,1,uInterface);
		CBUS_Read16 (0x4D,&data,1,uInterface);
		CBUS_Read16 (0x4D,&data,1,uInterface);
	}
	else
	{
		// If there are no device check words, we return a failure.
		return 0;
	}
	// Initialise the data pointer to the start of the FI image.
	pData = pFI->db1_start_address;
	while (1)
	{
			switch (state)
			{
				case 0:

					// For each of the data blocks set the start codes and length from the definitions in
					// the FI header file. The address of pData is used to identify the current data block.
					if (pData==pFI->db1_start_address)
					{
						start_code = pFI->db1_ptr;
						length = pFI->db1_len;
					}
					else if (pData==pFI->db2_start_address)
					{
						start_code =  pFI->db2_ptr;
						length = pFI->db2_len;
					}
					else if (pData==LOAD_FI_END)
					{
						start_code = pFI->activate_ptr;
						length = pFI->activate_len;
					}
					else
					{
						// If the data pointer setting is not recognised then we have an error condition.
						// So return with an error code.
						return 0;
					}
					state++;
					break;

				case 1:

					CBUS_Write16(0x49, &length,1,uInterface);
					CBUS_Write16(0x49, &start_code,1,uInterface);

					// At this point, if the length is 0 then we have reached the end of the data blocks and the
					// FI should be loaded, so return 1.
					if (length == 0)
					{
						// Check the FI has programmed by checking the programming bit - protect the loop
						// with a 1 second time out. Return 1 for success or 0 for failure..

						ClearCounter();
						while (ReadCounter()<1000000)
						{                                                  
							CBUS_Read16 (0x7E,&data,1,uInterface);
							if (data & 0x4000 && (pFI->type==CMX7262FI))
							{
								//read version code
                                                                CBUS_Read16 (0x4D,&data,1,uInterface);  //device type; ignore
                                                                CBUS_Read16 (0x4D,&data,1,uInterface);  //version (in hex) e.g. version 1.0.0.0 will be 0x1000
                                                                sprintf(tempstr,"%X",data);             //convert to string "1000"                                                  
                                                                dmr.Cmx7262.FIVersion = atoi(tempstr);  //convert to decimal 1000 for display
  
                                                                return 1;
							}
							if (data & 0x4000 && (pFI->type==CMX7161FI))
							{
								//read version code
                                                                CBUS_Read16 (0x4D,&data,1,uInterface);
                                                                CBUS_Read16 (0x4D,&data,1,uInterface);
                                                                sprintf(tempstr,"%X",data);                                                                
                                                                dmr.Cmx7161.FIVersion = atoi(tempstr);
                                                                return 1;
							}
						}
						// Program Failure.
						return 0;
					}
					else
					{
						// Move to next state to programme the target device with
						// the function image.
						state++;
					}

	 				break;

