NTLabRadio/SDRDemonstator9943/SDRDemon/Common/stm32f10x_sdr.c
				case 2:
					// There is a 128 deep FIFO on the CBUS interface which allows us to write
					// 128 words before checking the level register (0x4B). Check the level
					// register if the Tx FIFO count is 128. If the level does not reach zero in 1 second
					// we return an error code.
					if (uTxFIFOCount >= 128)
					{
						if (!CBUS_WaitBitClr8(0x4B,0xFF,uInterface))
							// Input FIFO level failure.
							return 0;
						uTxFIFOCount = 0;
					}
					CBUS_Write16(0x49,pData++,1,uInterface);
					length--;
					uTxFIFOCount++;

					// When the length is 0 we will be at the end of the current data block, so we
					// then work out which data block it is and set the data pointer to the next data
					// block or to END. If length is not 0 then there is still more data block to output.

					if (length == 0)
					{
						// If we are at the end of block 1 set the data pointer to the start of block 2.
						// Check if we are at the end of Block 1. If we are ....
						if (pData==(pFI->db1_start_address+pFI->db1_len))
						{
							// Read the level register but doing nothing with it.
							CBUS_Read8 (0x4F,(uint8_t *)&data,1,uInterface);
							// We are at the end of block 1, so read the checksums for the block and
							// return a failure if they are wrong.
							CBUS_Read16 (0x4D,&data,1,uInterface);
							if (data != pFI->db1_chk_hi)
								return 0;
							CBUS_Read16 (0x4D,&data,1,uInterface);
							if(data != pFI->db1_chk_lo)
								return 0;
							pData = pFI->db2_start_address;
						}
						// If we are at the end of block 2 set the data pointer to END.
						else if (pData==(pFI->db2_start_address+pFI->db2_len))
						{
							// Read the level register but doing nothing with it.
							CBUS_Read8 (0x4F,(uint8_t *)&data,1,uInterface);
							// We are at the end of block 2, so read the checksums for the block and
							// return a failure if they are wrong.
							CBUS_Read16 (0x4D,&data,1,uInterface);
							if (data != pFI->db2_chk_hi)
								return 0;
							CBUS_Read16 (0x4D,&data,1,uInterface);
							if(data != pFI->db2_chk_lo)
								return 0;
							pData = LOAD_FI_END;
						}
						state=0;
					}
					else
						state=2;
					break;
			}
		}

}
#else
#ifdef TARGET_PMR
//CMX7141 needs a different style of bootload
uint16_t wait_prog_bit(uint16_t uInterface, uint32_t timeout);

uint16_t SDR_Load_FI_7x4x (cmxFI_TypeDef *pFI, uint8_t uInterface )
{
	uint16_t	*pData;
	uint16_t 	start_code;
	uint16_t 	length;
	uint16_t	data;
	uint16_t	state;
	uint16_t	bootmode;
	//uint16_t	uTxFIFOCount;
        
        char tempstr[5];        //used to convert the version from hex to decimal

	//uTxFIFOCount = 0;
	data = 0;
	state = 0;
        bootmode = 1;   //cbus boot
	// Write a general reset to the pDSP6
	CBUS_Write8(1, (uint8_t *)&data, 0, uInterface);
	// Wait for a second.
	//ClearCounter();
	//while (ReadCounter() < 1000000);
        
        if (wait_prog_bit(uInterface, 1000000) == 0) return 0;

	// Initialise the data pointer to the start of the FI image.
	pData = pFI->db1_start_address;
	while (1)
	{
			switch (state)
			{
				case 0:

					// For each of the data blocks set the start codes and length from the definitions in
					// the FI header file. The address of pData is used to identify the current data block.
					if (pData==pFI->db1_start_address)
					{
						start_code = pFI->db1_ptr;
						length = pFI->db1_len;
					}
					else if (pData==pFI->db2_start_address)
					{
						start_code =  pFI->db2_ptr;
						length = pFI->db2_len;
					}
					else if (pData==LOAD_FI_END)
					{
						start_code = pFI->activate_ptr;
						length = pFI->activate_len;
					}
					else
					{
						// If the data pointer setting is not recognised then we have an error condition.
						// So return with an error code.
						return 0;
					}
					state++;
					break;

				case 1:
					CBUS_Write16(0xB6, &start_code,1,uInterface);
					CBUS_Write16(0xB7, &length,1,uInterface);                                        
                                        //if (wait_prog_bit(uInterface, 1000000) == 0) return 0;

                                        CBUS_Write16(0xC8, &bootmode, 1, uInterface); 					
                                        
                                        // At this point, if the length is 0 then we have reached the end of the data blocks and the
					// FI should be loaded, so read version, do checksums, activate and return
					if (length == 0)
					{
                                          if (wait_prog_bit(uInterface, 1000000) == 0) return 0;                                                                                   
                                          //read version code
                                          CBUS_Read16 (0xC9,&data,1,uInterface);  //version (in hex) e.g. version 1.0.0.0 will be 0x1000
                                          sprintf(tempstr,"%X",data);             //convert to string "1000"                                                  
                                          pmr.Cmx7141.FIVersion = atoi(tempstr);  //convert to decimal 1000 for display
					  //check the checksums	
                                          CBUS_Read16 (0xB8,&data,1,uInterface);
                                          if (data != pFI->db1_chk_hi)
                                                  return 0;
                                          
                                          CBUS_Read16 (0xB9,&data,1,uInterface);
                                          if (data != pFI->db1_chk_lo)
                                                  return 0;                                          

                                          CBUS_Read16 (0xA9,&data,1,uInterface);
                                          if (data != pFI->db2_chk_hi)
                                                  return 0;
                                          
                                          CBUS_Read16 (0xAA,&data,1,uInterface);
                                          if (data != pFI->db2_chk_lo)
                                                  return 0; 
                                         
                                          //load activation codes
                                          CBUS_Write16(0xC8,&pFI->activation_code1,1,uInterface); 
                                          if (wait_prog_bit(uInterface, 100000) == 0) return 0;
                                         
                                          CBUS_Write16(0xC8,&pFI->activation_code2,1,uInterface); 
                                          if (wait_prog_bit(uInterface, 100000) == 0) return 0;        
                                          
