NTLabRadio/SDRDemonstator9943/SDRDemon/Common/stm32f10x_sdr.c
                                          //check for successful activation
                                          CBUS_Read16 (0xB8,&data,1,uInterface);
                                          if (data == 0xDEAD)
                                                  return 0;                                          
          
                                          return 1;

					}
					else
					{
						// Move to next state to programme the target device with
						// the function image.
						state++;
					}

	 				break;

				case 2:
                                        if (wait_prog_bit(uInterface, 100000) == 0) return 0;
                                        CBUS_Write16(0xC8,pData++,1,uInterface);   			                                        
                                        length--;

					// When the length is 0 we will be at the end of the current data block, so we
					// then work out which data block it is and set the data pointer to the next data
					// block or to END. If length is not 0 then there is still more data block to output.

					if (length == 0)
					{
						// If we are at the end of block 1 set the data pointer to the start of block 2.
						// Check if we are at the end of Block 1. If we are ....
						if (pData==(pFI->db1_start_address+pFI->db1_len))
						{
							pData = pFI->db2_start_address;
						}
						// If we are at the end of block 2 set the data pointer to END.
						else if (pData==(pFI->db2_start_address+pFI->db2_len))
						{
							pData = LOAD_FI_END;
						}
						state=0;
					}
					else
						state=2;
					break;

			}
		}

}

//wait specified number of us for prog bit ($C6 b0)
//return 1 if bit set, 0 for timed out
uint16_t wait_prog_bit(uint16_t uInterface, uint32_t timeout)
{
  uint16_t data;
  
  ClearCounter();
  while (ReadCounter()<timeout)
  {                                                  
    CBUS_Read16 (0xC6,&data,1,uInterface);
    if (data & 0x0001) return 1;
  }
  return 0;  
}

#endif
#endif


// Delay Routines - Start

void TIM_ResetSMCR(TIM_TypeDef* TIMx)
{
   /* Select the Slave Mode */
  TIMx->SMCR = 0;
}

// Delay Routines - Start

// Timer 2 clocks Timer 3. Timer 2 is setup with a 1uS clock which wraps at 65536.
// When timer 2 wraps, it provides one tick of timer 3. So timer 3 is being clocked
// every 65.5mS (approx 15.2Hz). The combination of these timers create a 32 bit
// hardware counter being ticked at 1uS. These are used for delays in the code.
// The reality is a counter which wraps at 1hr 11mins.

/**
  * @brief  Configures the TIM Peripheral.
  * @param  None
  * @retval None
  */
void TIM2_Init(void)
{
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

  /* --------------------------- System Clocks Configuration -----------------*/
  /* TIM2 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

  /* Compute the prescaler value */
  // The timer is clocked at 1MHz (1uS period).
  /* Time base configuration */
  TIM_TimeBaseStructure.TIM_Period = 65535;
  TIM_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock) / 1000000) - 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

  // Ensures an update event is generated.
  TIM_UpdateDisableConfig(TIM2, DISABLE);

  // TIM2 set into master mode - update event is selected as trigger output (TRGO)
  TIM_SelectOutputTrigger(TIM2,TIM_TRGOSource_Update);

  /* Enable TIM2 Preload register on ARR */
  TIM_ARRPreloadConfig(TIM2, ENABLE);

   /* TIM2 enable counter */
  TIM_Cmd(TIM2, ENABLE);

}

void TIM3_Init(void)
{
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

  /* --------------------------- System Clocks Configuration -----------------*/
  /* TIM3 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

  // The end event from Timer 2 acts as the pre-scaler count for Timer 3.
  TIM_TimeBaseStructure.TIM_Period = 65535;
  TIM_TimeBaseStructure.TIM_Prescaler = 0;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

   /* Enable TIM3 Preload register on ARR */
  TIM_ARRPreloadConfig(TIM3, ENABLE);

  // Set SMCR register
  // Selects internal trigger for TIM3 from TIM2 and sets TIM3
  // slave controller into external clock mode.
  TIM_ITRxExternalClockConfig(TIM3,TIM_TS_ITR1);

  /* TIM3 enable counter */
  TIM_Cmd(TIM3, ENABLE);
}

/**
  * @brief  Configures the TIM Peripheral.
  * @param  None
  * @retval None
  */
// Since there are 8 timers on the Cortex M3, this timer is dedicated to monitoring
// timeouts of bits on the CMX7161 staus register.

void TIM4_Init(void)
{
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

  /* --------------------------- System Clocks Configuration -----------------*/
  /* TIM4 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

  /* Compute the prescaler value */
  // The timer is clocked at 10kHz (100uS period).
  /* Time base configuration */
  TIM_TimeBaseStructure.TIM_Period = 65535;
  TIM_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock) / 100000) - 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);

   /* Enable TIM4 Preload register on ARR */
  TIM_ARRPreloadConfig(TIM4, ENABLE);

   /* TIM4 enable counter */
  TIM_Cmd(TIM4, ENABLE);

}

/**
  * @brief  Configures the TIM Peripheral.
  * @param  None
  * @retval None
  */

// Since there are 8 timers on the Cortex M3, this timer is dedicated to monitoring
// timeouts of bits on the CMX7262 staus register.

void TIM5_Init(void)
{
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

  /* --------------------------- System Clocks Configuration -----------------*/
  /* TIM5 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);

  /* Compute the prescaler value */
  // The timer is clocked at 100kHz (10uS period).
  /* Time base configuration */
  TIM_TimeBaseStructure.TIM_Period = 65535;
  TIM_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock) / 100000) - 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(TIM5, &TIM_TimeBaseStructure);

   /* Enable TIM5 Preload register on ARR */
  TIM_ARRPreloadConfig(TIM5, ENABLE);

   /* TIM5 enable counter */
  TIM_Cmd(TIM5, ENABLE);

