NTLabRadio/SDRDemonstator9943/SDRDemon/Common/stm32f10x_sdr.c
}

// Delay Routines - End

// This routine reads back two timers and combines the result into one 32 bit value
// ticked at 1uS. Using ReadCounter and ClearCounter the combination of these timers
// create a 32 bit hardware counter being ticked at 1uS. These are used for delays in the
// code. The reality is a counter which wraps at 1hr 11mins.

uint32_t ReadCounter (void)
{
	uint32_t uCountResult = 0;
	uCountResult = TIM_GetCounter(TIM3) << 16;
	uCountResult = uCountResult | TIM_GetCounter(TIM2);
	return uCountResult;
}


void ClearCounter(void)
{
	TIM_SetCounter(TIM2,0);
	TIM_SetCounter(TIM3,0);
}

// Delay Routines - End


// CBUS Routines - Start

/**
  * @brief  Initializes the low level interface used to drive the CBUS
  * @param  None
  * @retval None
  */
void CBUS_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  SPI_InitTypeDef  SPI_InitStructure;

  /* Enable the SPI periph */
  RCC_APB2PeriphClockCmd(CBUS_SPI_CLK, ENABLE);

  /* Enable SCK, MOSI and MISO GPIO clocks */
  RCC_APB2PeriphClockCmd(CBUS_SPI_SCK_GPIO_CLK | CBUS_SPI_MISO_GPIO_CLK | CBUS_SPI_MOSI_GPIO_CLK, ENABLE);

  /* Enable CS  GPIO clock */
  RCC_APB2PeriphClockCmd(CBUS_SPI_CS_GPIO_CLK, ENABLE);

  GPIO_InitStructure.GPIO_Pin = CBUS_SPI_SCK_PIN | CBUS_SPI_MOSI_PIN | CBUS_SPI_MISO_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(CBUS_SPI_SCK_GPIO_PORT, &GPIO_InitStructure);
  
  
  GPIO_InitStructure.GPIO_Pin = CBUS_SPI_MISO_PIN;  
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;  
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(CBUS_SPI_SCK_GPIO_PORT, &GPIO_InitStructure); 
  
  /* SPI SCK pin configuration */
  //GPIO_InitStructure.GPIO_Pin = CBUS_SPI_SCK_PIN;
  //GPIO_Init(CBUS_SPI_SCK_GPIO_PORT, &GPIO_InitStructure);

  /* SPI  MOSI pin configuration */
  //GPIO_InitStructure.GPIO_Pin =  CBUS_SPI_MOSI_PIN;
  //GPIO_Init(CBUS_SPI_MOSI_GPIO_PORT, &GPIO_InitStructure);

  /* SPI MISO pin configuration */
  //GPIO_InitStructure.GPIO_Pin = CBUS_SPI_MISO_PIN;
  //GPIO_Init(CBUS_SPI_MISO_GPIO_PORT, &GPIO_InitStructure);

  /* SPI configuration -------------------------------------------------------*/
  SPI_I2S_DeInit(CBUS_SPI);
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  // The BaudRatePrescalar below sets the CBUS clock speed.
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_8;		// 8MHz approximately.
  //SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;	// 4MHz approximately.
  //SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_64;	// 1MHz approximately.
  //SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_128;	// 500kHz approximately.
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_Init(CBUS_SPI, &SPI_InitStructure);

  /* Enable SPI1  */
  SPI_Cmd(CBUS_SPI, ENABLE);

  // DAVED
  // On the discovery board, the chip select for the accelerometer
  // is located on Port E. Therefore there will be no conflict with using
  // chip selects on port A. We configure three chip selects for the three
  // CBUS interfaces.

  /* Configure GPIO PINs for CBUS Chip Selects */
  GPIO_InitStructure.GPIO_Pin = CBUS_SPI_CS1_PIN | CBUS_SPI_CS2_PIN | CBUS_SPI_CS3_PIN;
  //GPIO_InitStructure.GPIO_Pin = CBUS_SPI_CS1_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  //GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  //GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_DOWN;
  GPIO_Init(CBUS_SPI_CS_GPIO_PORT, &GPIO_InitStructure);

  /* Deselect : Chip Select high */
  GPIO_SetBits(CBUS_SPI_CS_GPIO_PORT, CBUS_SPI_CS1_PIN);
  GPIO_SetBits(CBUS_SPI_CS_GPIO_PORT, CBUS_SPI_CS2_PIN);
  GPIO_SetBits(CBUS_SPI_CS_GPIO_PORT, CBUS_SPI_CS3_PIN);

  /* Configure GPIO PINs for CBUS Status \ IRQs */
  GPIO_InitStructure.GPIO_Pin = CBUS_IRQN1_PIN | CBUS_IRQN3_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  //GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  //GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
  GPIO_Init(CBUS_SPI_CS_GPIO_PORT, &GPIO_InitStructure);

}


/**
  * @brief  Writes one byte to the CBUS.
  * @param  pBuffer : pointer to the buffer  containing the data to be written to the CBUS.
  * @param  WriteAddr : CBUS's internal address to write to.
  * @param  NumByteToWrite: Number of bytes to write.
  * @retval None
  */

void CBUS_Write16(uint8_t uAddress, uint16_t *data_ptr, uint16_t uAccesses, uint8_t uInterface)
{
	uint16_t uAccessCount;

	// An IRQ routine includes a CBUS access to clear the status register. Therefore
	// we do not want a none IRQ CBUS accesses to be disturbed. Otherwise there
	// could be problems with the chip select lines directing MISO\MOSI to the wrong
	// CBUS interface. Therefore, we disable interrupts for the duration of the CBUS
	// access.

	__disable_irq();


	/* Set chip select Low at the start of the transmission */
	CBUS_SetCSNLow(uInterface);

	/* Send the Address of the register */
	CBUS_SendByte(uAddress);

	for (uAccessCount=0; uAccessCount < uAccesses; uAccessCount++)
	{
		/* Send the data that will be written into the device (MSB First) */
		CBUS_SendByte((*data_ptr & 0xFF00)>>8);
		CBUS_SendByte(*data_ptr & 0x00FF);
		data_ptr++;
	}

	/* Set chip select High at the end of the transmission */
	CBUS_SetCSNHigh(uInterface);

	__enable_irq();

}


void CBUS_Read16 (uint8_t uAddress, uint16_t *data_ptr, uint16_t uAccesses, uint8_t uInterface)
{
	uint16_t uAccessCount;

	*data_ptr=0;

	// An IRQ routine includes a CBUS access to clear the status register. Therefore
	// we do not want a none IRQ CBUS accesses to be disturbed. Otherwise there
	// could be problems with the chip select lines directing MISO\MOSI to the wrong
	// CBUS interface. Therefore, we disable interrupts for the duration of the CBUS
	// access.

	__disable_irq();

	/* Set chip select Low at the start of the transmission */

	CBUS_SetCSNLow(uInterface);

	// Setup the CBUS address to read from.
    CBUS_SendByte(uAddress);

	for (uAccessCount = 0; uAccessCount < uAccesses; uAccessCount++)
	{
		*data_ptr=0;
		 // Send dummy byte (0x00) to generate the SPI clock to CBUS (Slave device).
		 // This reads the first byte for 2 byte accesses.
		 *data_ptr = (CBUS_SendByte(CBUS_DUMMY_BYTE) << 8);

