NTLabRadio/SDRDemonstator9943/SDRDemon/Common/stm32f10x_sdr.c
		 // Send dummy byte (0x00) to generate the SPI clock to CBUS (Slave device).
		 // This reads the second byte (for 2 byte accesses) or the first byte for single byte
		 // reads.
		 *data_ptr |= CBUS_SendByte(CBUS_DUMMY_BYTE);
		data_ptr++;
	}

	 /* Set chip select High at the end of the transmission */
	CBUS_SetCSNHigh(uInterface);

	__enable_irq();

}

// Supports byte wide CBUS streaming and efficient packing of bytes.

void CBUS_Write8(uint8_t uAddress, uint8_t *data_ptr, uint16_t uAccesses, uint8_t uInterface)
{
	uint16_t uAccessCount;

	// An IRQ routine includes a CBUS access to clear the status register. Therefore
	// we do not want a none IRQ CBUS accesses to be disturbed. Otherwise there
	// could be problems with the chip select lines directing MISO\MOSI to the wrong
	// CBUS interface. Therefore, we disable interrupts for the duration of the CBUS
	// access.

	__disable_irq();

	/* Set chip select Low at the start of the transmission */
	CBUS_SetCSNLow(uInterface);

	/* Send the Address of the register */
	CBUS_SendByte(uAddress);

	for (uAccessCount=0; uAccessCount < uAccesses; uAccessCount++)
	{
		/* Send the data that will be written into the device  */
		CBUS_SendByte(*data_ptr);
		data_ptr++;
	}

	/* Set chip select High at the end of the transmission */
	CBUS_SetCSNHigh(uInterface);

	__enable_irq();

}


// Supports byte wide CBUS streaming and efficient packing of bytes.

void CBUS_Read8 (uint8_t uAddress, uint8_t *data_ptr, uint16_t uAccesses, uint8_t uInterface)
{
	uint16_t uAccessCount;

	*data_ptr=0;

	// An IRQ routine includes a CBUS access to clear the status register. Therefore
	// we do not want a none IRQ CBUS accesses to be disturbed. Otherwise there
	// could be problems with the chip select lines directing MISO\MOSI to the wrong
	// CBUS interface. Therefore, we disable interrupts for the duration of the CBUS
	// access.

	__disable_irq();

	/* Set chip select Low at the start of the transmission */
	CBUS_SetCSNLow(uInterface);

	// Setup the CBUS address to read from.
    CBUS_SendByte(uAddress);

	for (uAccessCount = 0; uAccessCount < uAccesses; uAccessCount++)
	{
		// Send dummy byte (0x00) to generate the SPI clock to CBUS (Slave device).
		// This reads the first byte for single byte  reads.
		*data_ptr = CBUS_SendByte(CBUS_DUMMY_BYTE);
		data_ptr++;
	}

	 /* Set chip select High at the end of the transmission */
	CBUS_SetCSNHigh(uInterface);

	__enable_irq();

}



// Continually read a CBUS register until the bits in the mask are set or the 1 second
// timeout expires. Returns 1 when the mask is matched. Otherwise 0 for a timeout.

uint16_t	CBUS_WaitBitSet16 (uint8_t Address, uint16_t uMask, uint8_t uInterface)
{
	uint16_t data;

	ClearCounter();
	while (ReadCounter()<1000000)
	{
		data = 0;
		CBUS_Read16 (Address,&data,1,uInterface);
		if (uMask == (data & uMask))
		{
			return data;
		}
	}
	return 0;
}

// Continually read a CBUS register until the bits in the mask are clear or the 1 second
// timeout expires. Returns 1 when the bits in the mask are clear. Otherwise 0 for a timeout.

uint16_t	CBUS_WaitBitClr8(uint8_t Address, uint8_t uMask, uint8_t uInterface)
{
	uint8_t data;

	ClearCounter();
	// Timeout set at 1 second.
	while (ReadCounter()<1000000)
	{
		data = 0;
		CBUS_Read8 (Address,&data,1,uInterface);
		if ((data & ~uMask)==0)
		{
			return 1;
		}
	}
	return 0;
}


/**
  * @brief  Sends a Byte through the SPI interface and return the Byte received
  *         from the SPI bus.
  * @param  Byte : Byte send.
  * @retval The received byte value
  */
uint8_t CBUS_SendByte(uint8_t byte)
{
  /* Loop while DR register in not emplty */
  CBUSTimeout = CBUS_TIME_OUT;
  while (SPI_I2S_GetFlagStatus(CBUS_SPI, SPI_I2S_FLAG_TXE) == RESET)
  {
    if((CBUSTimeout--) == 0) return CBUS_TIMEOUT_UserCallback();
  }

  /* Send a Byte through the SPI peripheral */
  SPI_I2S_SendData(CBUS_SPI, byte);

   /* Wait to receive a Byte */
  CBUSTimeout = CBUS_TIME_OUT;
  while (SPI_I2S_GetFlagStatus(CBUS_SPI, SPI_I2S_FLAG_RXNE) == RESET)
  {
    if((CBUSTimeout--) == 0) return CBUS_TIMEOUT_UserCallback();
  }

  /* Return the Byte read from the SPI bus */
  return (uint8_t)SPI_I2S_ReceiveData(CBUS_SPI);
}

/*
 * Set the CSN bit low based on the mask.
 */

void CBUS_SetCSNLow(uint8_t uMask)
{
	if((uMask & 0x03) == 0)
	{
		CBUS_CSN1_LOW();
	}
	else if ((uMask & 0x03) == 1)
	{
		CBUS_CSN2_LOW();
	}
	else if ((uMask & 0x03) == 2)
	{
		CBUS_CSN3_LOW();
	}

	// If none of the above are true we do not touch the CSN (chip select) lines.
}

/*
 * Set the CSN bit high based on the mask.
 */

void CBUS_SetCSNHigh(uint8_t uMask)
{
	if((uMask & 0x03) == 0)
	{
		CBUS_CSN1_HIGH();
	}
	else if ((uMask & 0x03) == 1)
	{
		CBUS_CSN2_HIGH();
	}
	else if ((uMask & 0x03) == 2)
	{
		CBUS_CSN3_HIGH();
	}

	// If none of the above are true we do not touch the CSN (chip select) lines.

}


/**
  * @brief  Basic management of the timeout situation.
  * @param  None.
  * @retval None.
  */
uint32_t CBUS_TIMEOUT_UserCallback(void)
{
	//GPIO_SetBits(GPIOD,GPIO_Pin_14);		// Light the Red LED on a CBUS failure.
	// Delaty the toggle by 0.5s
	//Delay(50);
	return 0;
}

// CBUS Routines - End


// USART Routines - Start

/**
  * @brief  Function to configure software to drive the FT232RL (FTDI UART) chip.
  * @param  None
  * @retval None
  */

void FT232_USART_Init(void)
{
	USART_InitTypeDef USART_InitStructure;

	// Enable the FT232 USART periph
	RCC_APB2PeriphClockCmd(FT232_USART_CLOCK, ENABLE);

	// Enable TX, RX, CTS and RTS clocks
	RCC_APB2PeriphClockCmd(FT232_USART_TX_GPIO_CLK | FT232_USART_RX_GPIO_CLK | FT232_USART_CTS_GPIO_CLK | FT232_USART_RTS_GPIO_CLK, ENABLE);

	// Map the USART interface to the IO pins on port A (Alternative function)
	//GPIO_PinAFConfig(FT232_USART_TX_GPIO_PORT,FT232_USART_TX_SOURCE,FT232_USART_TX_AF);
	//GPIO_PinAFConfig(FT232_USART_RX_GPIO_PORT,FT232_USART_RX_SOURCE,FT232_USART_RX_AF);
	//GPIO_PinAFConfig(FT232_USART_CTS_GPIO_PORT,FT232_USART_CTS_SOURCE,FT232_USART_CTS_AF);
	//GPIO_PinAFConfig(FT232_USART_RTS_GPIO_PORT,FT232_USART_RTS_SOURCE,FT232_USART_RTS_AF);

	GPIO_InitStructure.GPIO_Pin =  FT232_USART_RX_PIN | FT232_USART_CTS_PIN;
        //GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
        
        //GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
        //GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(FT232_USART_TX_GPIO_PORT, &GPIO_InitStructure);
        


        GPIO_InitStructure.GPIO_Pin =  FT232_USART_TX_PIN | FT232_USART_RTS_PIN | GPIO_Pin_8;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
        GPIO_Init(FT232_USART_TX_GPIO_PORT, &GPIO_InitStructure);
        
