NTLabRadio/SDRDemonstator9943/SDRDemon/Common/stm32f10x_sdr.c
	/* TX pin configuration */
	//GPIO_InitStructure.GPIO_Pin = FT232_USART_TX_PIN ;
	//GPIO_Init(FT232_USART_TX_GPIO_PORT, &GPIO_InitStructure);

	/* RX pin configuration */
	//GPIO_InitStructure.GPIO_Pin = FT232_USART_RX_PIN ;
	//GPIO_Init(FT232_USART_RX_GPIO_PORT, &GPIO_InitStructure);

	/* CTS pin configuration */
	//GPIO_InitStructure.GPIO_Pin = FT232_USART_CTS_PIN ;
	//GPIO_Init(FT232_USART_CTS_GPIO_PORT, &GPIO_InitStructure);

	/* RTS pin configuration */
	//GPIO_InitStructure.GPIO_Pin = FT232_USART_RTS_PIN ;
	//GPIO_Init(FT232_USART_RTS_GPIO_PORT, &GPIO_InitStructure);

	/* USART configuration -------------------------------------------------------*/
	USART_DeInit(FT232_USART);
	/* USART_InitStruct members default value */
	USART_InitStructure.USART_BaudRate =1250000;// 115200;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No ;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//USART_HardwareFlowControl_RTS_CTS;//
	USART_Init(FT232_USART, &USART_InitStructure);
	/* Enable FT232 USART  */
	USART_Cmd(FT232_USART, ENABLE);

}


void FT232_USART_Write(uint8_t* pBuffer, uint16_t NumByteToWrite)
{
  /* Send the data that will be written into the device (MSB First) */
  while(NumByteToWrite >= 0x01)
  {
    FT232_USART_SendByte(*pBuffer);
    NumByteToWrite--;
    pBuffer++;
  }
}


void FT232_USART_Read(uint8_t* pBuffer,  uint16_t NumByteToRead)
{
  /* Receive the data that will be read from USART */
  while(NumByteToRead > 0x00)
  {
     *pBuffer = FT232_USART_ReadByte();
    NumByteToRead--;
    pBuffer++;
  }
}


/**
  *
  * When the transmit buffer is empty a byte is written to the USART.
  * Returns 0 on a timeout.
  *
  */

uint8_t FT232_USART_SendByte(uint8_t byte)
{
  /* Loop while DR register in not emplty */
  FT232_USARTTimeout = FT232_USART_FLAG_TIMEOUT;
  while (USART_GetFlagStatus(FT232_USART, USART_FLAG_TXE) == RESET)
  {
    if((FT232_USARTTimeout--) == 0) return (uint8_t)FT232_USART_TIMEOUT_UserCallback();
  }
  /* Send a Byte through the USART peripheral */
  USART_SendData(FT232_USART, byte);
  return 1;
}



uint8_t FT232_USART_ReadByte(void)
{
/* Wait to receive a Byte */
FT232_USARTTimeout = FT232_USART_FLAG_TIMEOUT;
while (USART_GetFlagStatus(FT232_USART,USART_FLAG_RXNE) == RESET)
{
 if((CBUSTimeout--) == 0) return (uint8_t)FT232_USART_TIMEOUT_UserCallback();
}
/* Return the Byte read from the SPI bus */
return (uint8_t)USART_ReceiveData(FT232_USART);
}

/**
  * @brief  Toggles the specified GPIO pins..
  * @param  GPIOx: where x can be (A..I) to select the GPIO peripheral.
  * @param  GPIO_Pin: Specifies the pins to be toggled.
  * @retval None
  */
void GPIO_ToggleBits(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_PERIPH(GPIOx));

  GPIOx->ODR ^= GPIO_Pin;
}

/**
  * @brief  Basic management of the timeout situation.
  * @param  None.
  * @retval None.
  */
uint32_t FT232_USART_TIMEOUT_UserCallback(void)
{
	GPIO_ToggleBits(GPIOD,GPIO_Pin_12);
	// Delaty the toggle by 0.5s
	//Delay(50);
	return 0;
}




// USART Routines - End


// A dummy IRQ that we initialise the IRQ function pointer too, so if the IRQ gets accidently fired
// the code will at least action an IRQ.
void	SDR_Dummy_IRQ (void *pData)
{
}
